CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_qspi.h
/* QSPI_STAT */
#define QSPI_STAT_TERR                    BIT(0)                               /*!< transfer error flag */
#define QSPI_STAT_TC                      BIT(1)                               /*!< transfer complete flag */
#define QSPI_STAT_FT                      BIT(2)                               /*!< fifo threshold flag */
#define QSPI_STAT_SM                      BIT(3)                               /*!< status match flag */
#define QSPI_STAT_TMOUT                   BIT(4)                               /*!< timeout flag */
#define QSPI_STAT_WS                      BIT(5)                               /*!< wrong start sequence flag */
#define QSPI_STAT_TERRIE                  BIT(6)                               /*!< enable transfer error interrupt */
#define QSPI_STAT_TCIE                    BIT(7)                               /*!< enable transfer complete interrupt */
#define QSPI_STAT_FTIE                    BIT(8)                               /*!< enable fifo threshold */
#define QSPI_STAT_SMIE                    BIT(9)                               /*!< enable status match */
#define QSPI_STAT_TMOUTIE                 BIT(10)                              /*!< enable timeout */
#define QSPI_STAT_WSIE                    BIT(11)                              /*!< enable wrong start sequence */
#define QSPI_STAT_DMAEN                   BIT(16)                              /*!< enable dma */


/* QSPI_STATC */
#define QSPI_STATC_TERRC                  BIT(0)                               /*!< clear transfer error flag */
#define QSPI_STATC_TCC                    BIT(1)                               /*!< clear transfer complete flag */
#define QSPI_STATC_SMC                    BIT(3)                               /*!< clear status match flag */
#define QSPI_STATC_TMOUTC                 BIT(4)                               /*!< clear timeout flag */
#define QSPI_STATC_WSC                    BIT(5)                               /*!< clear wrong start sequence flag */

/* QSPI_DTLEN */
#define QSPI_DTLEN_DTLEN                  BITS(0,31)                           /*!< data length */

/* QSPI_TCFG */
#define QSPI_TCFG_INSTRUCTION             BITS(0,7)                            /*!< command information to be send to the flash memory */
#define QSPI_TCFG_IMOD                    BITS(8,9)                            /*!< instruction mode */
#define QSPI_TCFG_ADDRMOD                 BITS(10,11)                          /*!< address mode */
#define QSPI_TCFG_ADDRSZ                  BITS(12,13)                          /*!< address size */
#define QSPI_TCFG_ALTEMOD                 BITS(14,15)                          /*!< alternate bytes mode */
#define QSPI_TCFG_ALTESZ                  BITS(16,17)                          /*!< alternate bytes size */
#define QSPI_TCFG_DUMYC                   BITS(18,22)                          /*!< number of dummy cycles */
#define QSPI_TCFG_DATAMOD                 BITS(24,25)                          /*!< data mode */
#define QSPI_TCFG_FMOD                    BITS(26,27)                          /*!< functional mode */
#define QSPI_TCFG_SIOO                    BIT(28)                              /*!< send instruction only once */

/* QSPI_ADDR */
#define QSPI_ADDR_ADDR                    BITS(0,31)                           /*!< address to be send to the external flash memory */

/* QSPI_ALTE */
#define QSPI_ALTE_ALTE                    BITS(0,31)                           /*!< optional data to be send to the flash memory */

/* QSPI_DATA */
#define QSPI_DATA_DATA                    BITS(0,31)                           /*!< data to be transferred through the flash memory */

/* QSPI_STATMK */
#define QSPI_STATMK_MASK                  BITS(0,31)                           /*!< status mask */

/* QSPI_STATMA */
#define QSPI_STATMATCH_MATCH              BITS(0,31)                           /*!< status match */

/* QSPI_INTERVAL */
#define QSPI_INTERVAL_INTERVAL            BITS(0,15)                           /*!< interval cycle */

/* QSPI_TMOUT */
#define QSPI_TMOUT_TMOUT                  BITS(0,15)                           /*!< timeout cycle */

/* QSPI_FLUSH */
#define QSPI_FLUSH_FLUSH                  BIT(0)                               /*!< used to flush all qspi interval fifo */

/* QSPI_WTCNT */
#define QSPI_WTCNT_WTCNT                  BITS(0,31)                           /*!< wait cnt when an indirect write operation is completed or aborted */

/* QSPI_SPTMOUT */
#define QSPI_SPTMOUT_SPTMOUT              BITS(0,31)                           /*!< timeout cnt when a FMC transfer trys to abort a status polling mode operation */

/* QSPI_FMC_SECCFG */
#define QSPI_FMC_SECCFG_FMCSEC            BIT(0)                               /*!< use for indicate if register of FMC mode is secure or not */

/* QSPI_CTLF */
#define QSPI_CTLF_SSAMPLEF                BITS(4,5)                            /*!< sample shift in FMC mode */
#define QSPI_CTLF_SCKDENF                 BIT(6)                               /*!< sck delay enable when read data from flash in FMC mode */
#define QSPI_CTLF_SCKDVALUEF              BITS(12,15)                          /*!< sck delay value in FMC mode */
#define QSPI_CTLF_CSHCF                   BITS(16,18)                          /*!< the number of sck delay value */
#define QSPI_CTLF_CKMODF                  BIT(23)                              /*!< this bit indicates the sck level in FMC mode when qspi is free */
#define QSPI_CTLF_PSCF                    BITS(24,31)                          /*!< prescaler set */

/* QSPI_TCFGF */
#define QSPI_TCFGF_INSTRUCTIONF           BITS(0,7)                            /*!< instruction in FMC mode */
#define QSPI_TCFGF_IMODF                  BITS(8,9)                            /*!< instruction mode in FMC mode */
#define QSPI_TCFGF_ADDRMODF               BITS(10,11)                          /*!< address mode in FMC mode */
#define QSPI_TCFGF_ADDRSZF                BITS(12,13)                          /*!< address size in FMC mode */
#define QSPI_TCFGF_ALTEMODF               BITS(14,15)                          /*!< alternate bytes mode in FMC mode */
#define QSPI_TCFGF_ALTESZF                BITS(16,17)                          /*!< alternate bytes size in FMC mode */
#define QSPI_TCFGF_DUMYCF                 BITS(18,22)                          /*!< number of dummy cycles in FMC mode */
#define QSPI_TCFGF_DATAMODF               BITS(24,25)                          /*!< data mode in FMC mode */
#define QSPI_TCFGF_SIOOF                  BIT(28)                              /*!< send instruction only once mode in FMC mode */

/* QSPI_ALTEF */
#define QSPI_ALTEF_ALTEF                  BITS(0,31)                           /*!< alternate bytes in FMC mode */

/* QSPI_BYTE_CNT */
#define QSPI_BYTE_CNT_BYTECNT             BITS(0,31)                           /*!< remained bytes which has been aborted by FMC mode */

