CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_qspi.h
/* QSPI_PRIVCFG */
#define QSPI_PRIVCFG_PRIV                 BIT(0)                               /*!< use for indicate if register is privileged */

/* constants definitions */
/* qspi init struct definitions */
typedef struct
{
    uint32_t prescaler;           /* specifies the prescaler factor for generating clock based on the AHB clock.
                                  this parameter can be a number between 0 and 255 */ 
    uint32_t fifo_threshold;      /* specifies the threshold number of bytes in the FIFO (used only in indirect mode)
                                  this parameter can be a value between 1 and 16 */
    uint32_t sample_shift;        /* specifies the Sample Shift. the data is sampled 1/2 clock cycle delay later to 
                                  take in account external signal delays */
    uint32_t flash_size;          /* specifies the Flash Size. FlashSize+1 is effectively the number of address bits 
                                  required to address the flash memory. The flash capacity can be up to 4GB 
                                  (addressed using 32 bits) in indirect mode, but the addressable space in 
                                  memory-mapped mode is limited to 256MB
                                  this parameter can be a number between 0 and 31 */
    uint32_t cs_high_time;       /* specifies the chip select high time. cs_high_time+1 defines the minimum number 
                                  of clock cycles which the chip select must remain high between commands */   
    uint32_t clock_mode;           /* specifies the clock mode. it indicates the level that clock takes between commands */
}qspi_init_struct;

/* qspi command struct definitions */
typedef struct
{
    uint32_t instruction_mode;   /* specifies the instruction mode */
    uint32_t instruction;        /* specifies the instruction to be sent
                                  this parameter can be a value (8-bit) between 0x00 and 0xFF */
    uint32_t addr_mode;          /* specifies the address mode */
    uint32_t addr_size;          /* specifies the address size */
    uint32_t addr;               /* specifies the address to be sent (Size from 1 to 4 bytes according addressSize)
                                  this parameter can be a value (32-bits) between 0x0 and 0xFFFFFFFF */
    uint32_t altebytes_mode;     /* specifies the alternate bytes mode */
    uint32_t altebytes_size;     /* specifies the alternate bytes size */
    uint32_t altebytes;          /* specifies the alternate Bytes to be sent (size from 1 to 4 bytes according alternatebytessize)
                                  this parameter can be a value (32-bits) between 0x0 and 0xFFFFFFFF */
    uint32_t dummycycles;        /* specifies the number of dummy cycles.
                                  this parameter can be a number between 0 and 31 */
    uint32_t data_mode;          /* specifies the data mode (used for dummy cycles and data phases) */
    uint32_t data_length;        /* specifies the number of data to transfer. (this is the number of bytes)
                                  this parameter can be any value between 0 and 0xFFFFFFFF (0 means undefined length 
                                  until end of memory)*/
    uint32_t sioo_mode;          /* specifies the send instruction only once mode */
}qspi_command_struct;

/* qspi autopolling struct definitions */
typedef struct
{
    uint32_t match;              /* specifies the value to be compared with the masked status register to get a match.
                                  this parameter can be any value between 0 and 0xFFFFFFFF */
    uint32_t mask;               /* specifies the mask to be applied to the status bytes received. 
                                  this parameter can be any value between 0 and 0xFFFFFFFF */
    uint32_t interval;           /* specifies the number of clock cycles between two read during automatic polling phases.
                                  this parameter can be any value between 0 and 0xFFFF */
    uint32_t statusbytes_size;   /* specifies the size of the status bytes received.
                                  this parameter can be any value between 1 and 4 */
    uint32_t match_mode;         /* specifies the method used for determining a match. */
    uint32_t auto_stop;          /* specifies if automatic polling is stopped after a match. */
}qspi_autopolling_struct;

/* QSPI flag definitions */
#define QSPI_FLAG_BUSY                    QSPI_CTL_BUSY                        /*!< busy flag */
#define QSPI_FLAG_TERR                    QSPI_STAT_TERR                       /*!< transfer error flag */
#define QSPI_FLAG_TC                      QSPI_STAT_TC                         /*!< transfer complete flag */
#define QSPI_FLAG_FT                      QSPI_STAT_FT                         /*!< fifo threshold flag */
#define QSPI_FLAG_SM                      QSPI_STAT_SM                         /*!< status match flag */
#define QSPI_FLAG_TMOUT                   QSPI_STAT_TMOUT                      /*!< timeout flag */
#define QSPI_FLAG_WS                      QSPI_STAT_WS                         /*!< wrong start sequence flag */
#define QSPI_FLAG_TERRIE                  QSPI_STAT_TERRIE                     /*!< enable transfer error interrupt */
#define QSPI_FLAG_TCIE                    QSPI_STAT_TCIE                       /*!< enable transfer complete interrupt */
#define QSPI_FLAG_FTIE                    QSPI_STAT_FTIE                       /*!< enable fifo threshold */
#define QSPI_FLAG_SMIE                    QSPI_STAT_SMIE                       /*!< enable status match */
#define QSPI_FLAG_TMOUTIE                 QSPI_STAT_TMOUTIE                    /*!< enable timeout */
#define QSPI_FLAG_WSIE                    QSPI_STAT_WSIE                       /*!< enable wrong start sequence */

/* enable QSPI dma */
#define QSPI_DMAEN                        QSPI_STAT_DMAEN                      /*!< enable dma */

/* QSPI clock mode */
#define QSPI_CLOCK_MODE_0                 0x00000000                           /*!< qspi clock mode 0 */
#define QSPI_CLOCK_MODE_3                 QSPI_DCFG_CKMOD                      /*!< qspi clock mode 3 */

/* QSPI sample shift */
#define CTL_SSAMPLE(regval)               (BITS(4,5) & ((uint32_t)(regval) << 4))
#define QSPI_SAMPLE_SHIFTING_NONE         CTL_SSAMPLE(0)                             /*!< no shift when sample data */
#define QSPI_SAMPLE_SHIFTING_HALFCYCLE    CTL_SSAMPLE(1)                             /*!< 1/2 sck cycle shift when sample data */
#define QSPI_SAMPLE_SHIFTING_ONECYCLE     CTL_SSAMPLE(2)                             /*!< one sck cycle shift when sample data */

