CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Include/gd32w51x_qspi.h
/* QSPI interrupt enable/disable constants definitions */
#define QSPI_INT_TC                      ((uint8_t)0x00U)                            /*!< transfer complete interrupt */
#define QSPI_INT_FT                      ((uint8_t)0x01U)                            /*!< FIFO threshold interrupt */
#define QSPI_INT_TERR                    ((uint8_t)0x02U)                            /*!< transfer error interrupt */
#define QSPI_INT_SM                      ((uint8_t)0x03U)                            /*!< status match interrupt */
#define QSPI_INT_TMOUT                   ((uint8_t)0x04U)                            /*!< timeout interrupt */
#define QSPI_INT_WS                      ((uint8_t)0x05U)                            /*!< wrong start sequence interrupt */

/* function declarations */
/* QSPI deinitialization and initialization functions */
/* reset QSPI */
void qspi_deinit(void);
/* initialize the parameters of QSPI init struct with the default values */
void qspi_init_struct_para_init(qspi_init_struct* qspi_struct);
/* initialize QSPI parameter */
void qspi_init(qspi_init_struct* qspi_struct);
/* enable QSPI */
void quad_spi_enable(void);
/* disable QSPI */
void quad_spi_disable(void);
/* enable QSPI DMA */
void qspi_dma_enable(void);
/* disable QSPI DMA */
void qspi_dma_disable(void);
/* QSPI command parameter configure*/
void qspi_command(qspi_command_struct* cmd);
/* QSPI transmit data */
void qspi_transmit(uint8_t *tdata);
/* QSPI receive data */
void qspi_receive(uint8_t *rdata);
/* configure QSPI autopolling mode */
void qspi_autopolling(qspi_command_struct *cmd, qspi_autopolling_struct *cfg);
/* configure QSPI memorymapped mode */
void qspi_memorymapped(qspi_command_struct *cmd, uint16_t timeout, uint32_t toen);
/* abort the current transmission */
void qspi_abort(void);

/* QSPI command parameter configure in FMC mode use secure register*/
void qspi_command_fmc_s(qspi_command_struct* cmd);
/* QSPI transmit data in FMC mode use secure register*/
void qspi_transmit_fmc_s(uint8_t *tdata);
/* QSPI receive data in FMC mode use secure register*/
void qspi_receive_fmc_s(uint8_t *rdata);
/* configure QSPI autopolling mode in FMC mode use secure register*/
void qspi_autopolling_fmc_s(qspi_command_struct *cmd, qspi_autopolling_struct *cfg);
/* configure QSPI memorymapped mode in FMC mode use secure register*/
void qspi_memorymapped_fmc_s(qspi_command_struct *cmd, uint16_t timeout, uint32_t toen);

/* flag and interrupt functions */
/* enable QSPI interrupt */
void qspi_interrupt_enable(uint8_t interrupt);
/* disable QSPI interrupt */
void qspi_interrupt_disable(uint8_t interrupt);
/* get QSPI flag status */
FlagStatus qspi_flag_get(uint32_t flag);
/* clear QSPI flag status */
void qspi_flag_clear(uint32_t flag);

#endif /* GD32W51X_QSPI_H */
